#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Это вводная миссия, целью которой является показать как решать задачи на CheckiO или как получить максимум от этого.
# Итак, это самая простая миссия. Напишите функцию, которая будет получать 2 числа и возвращать результат произведения
# этих чисел.
# Входные данные: Два аргумента. Оба int
# Выходные данные: Int.

def mult_two(a, b):
    return a * b


print(mult_two(3, 2))  # 6
print(mult_two(1, 0))  # 0
