#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Эта программа демонстрирует бесконечный цикл.
# Создать переменную, которая будет управлять циклом.
keep_going = 'д'
# Предупреждение! Бесконечный цикл!
while keep_going == 'д':
    # Получить продажи продавца и его ставку комиссионных.
    sales = float(input('Введите объем продаж: '))
    comm_rate = float(input('Введите ставку комиссионных: '))
    # Рассчитать комиссионное вознаграждение.
    commission = sales * comm_rate
    # Показать комиссионное вознаграждение.
    print(f'Комиссия составляет ${commission:,.2f}.')
