#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# ЗАДАЧА №40 - 2^N
# (Время: 1 сек. Память: 16 Мб Сложность: 30%)
# Необходимо вычислить значение 2n.
# Входные данные - В единственной строке входного файла INPUT.TXT записано натуральное число n (0 < n < 1000).
# Выходные данные - В единственную строку выходного файла OUTPUT.TXT нужно вывести значение 2n.
print(2 ** int(input()))
