#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# ЗАДАЧА №144 - A*B
# (Время: 1 сек. Память: 16 Мб Сложность: 37%)
# Даны два целых неотрицательных числа A и B. Требуется найти их произведение.
# Входные данные - Во входном файле INPUT.TXT записаны целые неотрицательные числа A и B по одному в строке (A < 10100,
# B ≤ 10000).
# Выходные данные - В выходной файл OUTPUT.TXT выведите единственное число без лидирующих нулей: A*B.
print(int(input()) * int(input()))
