#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# ЗАДАЧА №145 - A div B
# (Время: 1 сек. Память: 16 Мб Сложность: 40%)
# Даны два целых числа A и B. Требуется найти их целую часть от их частного.
# Входные данные - Во входном файле INPUT.TXT записаны целые числа A и B по одному в строке (0 ≤ A ≤ 10100,
# 0 < B ≤ 10000).
# Выходные данные - В выходной файл OUTPUT.TXT выведите единственное число без лидирующих нулей: A div B.
print(int(input()) // int(input()))
