#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# ЗАДАЧА №143 - A-B
# (Время: 1 сек. Память: 16 Мб Сложность: 44%)
# Требуется найти разность между неотрицательными числами А и В.
# Входные данные - Во входном файле INPUT.TXT в двух строках записаны два неотрицательных целых числа A и B, не
# превышающие 10^1000.
# Выходные данные - В выходной файл OUTPUT.TXT выведите значение A-B.
print(int(input()) - int(input()))
