#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# ЗАДАЧА №363 - Длинное произведение
# (Время: 1 сек. Память: 16 Мб Сложность: 46%)
# Даны целые неотрицательные числа M и N. Требуется найти произведение этих чисел.
# Входные данные - Входной файл INPUT.TXT содержит в первой строке число M, а во второй строке – число N. (0 ≤ M,
# N ≤ 10^2500)
# Выходные данные - В выходной файл OUTPUT.TXT выведите произведение чисел M и N.
print(int(input()) * int(input()))
