#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# ЗАДАЧА №534 - Клавиатура - 2
# (Время: 1 сек. Память: 16 Мб Сложность: 25%)
# Всем известно, что со временем клавиатура изнашивается, и клавиши на ней начинают залипать. Конечно, некоторое время
# такую клавиатуру еще можно использовать, но для нажатий клавиш приходиться использовать большую силу.
# При изготовлении клавиатуры изначально для каждой клавиши задается количество нажатий, которое она должна выдерживать.
# Если знать эти величины для используемой клавиатуры, то для определенной последовательности нажатых клавиш можно
# определить, какие клавиши в процессе их использования сломаются, а какие – нет.
# Требуется написать программу, определяющую, какие клавиши сломаются в процессе заданного варианта эксплуатации
# клавиатуры.
# Входные данные - Первая строка входного файла INPUT.TXT содержит целое число N (1 ≤ N ≤ 100) – количество клавиш на
# клавиатуре. Вторая строка содержит n целых чисел – с1, с2, … , сN, где сi (1 ≤ сi ≤ 100000) – количество нажатий,
# выдерживаемых i-ой клавишей. Третья строка содержит целое число K (1 ≤ K ≤ 100000) – общее количество нажатий клавиш,
# и последняя строка содержит K целых чисел pj (1 ≤ pj ≤ N) – последовательность нажатых клавиш.
# Выходные данные - В выходной файл OUTPUT.TXT необходимо вывести N строк, содержащих информацию об исправности клавиш.
# Если i-ая клавиша сломалась, то i-ая строка должна содержать слово "yes" (без кавычек), если же клавиша работоспособна
# – слово "no".
a = input()
b = [int(i) for i in input().split()]
c = input()
for i in map(int, input().split()):
    b[i - 1] -= 1
for j in b:
    print('yes' if j < 0 else 'no')
# Или
a = input()
b = list(map(int, input().split()))
c = input()
for i in map(int, input().split()):
    b[i - 1] -= 1
for j in b:
    print('yes' if j < 0 else 'no')
# Или
a = int(input())
b = list(map(int, input().split()))
c = int(input())
for i in map(int, input().split()):
    b[i - 1] -= 1
for j in b:
    print('yes' if j < 0 else 'no')

