#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# ЗАДАЧА №1110 - Последняя цифра
# (Время: 1 сек. Память: 16 Мб Сложность: 3%)
# Требуется определить последнюю цифру натурального числа.
# Входные данные - Входной файл INPUT.TXT содержит натуральное число, не превосходящее 109.
# Выходные данные - В выходной файл OUTPUT.TXT выведите последнюю цифру заданного числа.
print(input()[-1])
