#!/usr/bin/env python3
# -*- coding: utf-8 -*-

import re  # Подключаем модуль re

# ГЛАВА 7
# Регулярные выражения
# Регулярное выражение - это шаблон, применяемый для поиска совпадающих с ним фрагментов в строках. Регулярное выражение
# состоит как из обычных знаков, так и всевозможных специальных символов: метасимволов, квантификаторов и др.
# В Python использовать регулярные выражения позволяет модуль re, который необходимо предварительно подключить с помощью
# инструкции:
# import re


# 7.1. Синтаксис регулярных выражений
print('7.1. Синтаксис регулярных выражений')
# Создать откомпилированное и готовое к использованию регулярное выражение позволяет функция compile(). Формат ее
# вызова:
# re.compile(<Шаблон регулярного выражения>[, <Флаги>])
# Шаблон создаваемого регулярного выражения указывается в виде строки или последовательности байтов типа bytes или
# bytearray. Флаги управляют особенностями обработки регулярного выражения. Можно указать как один флаг, так и их
# комбинацию через оператор |. Все поддерживаемые флаги также объявлены в модуле re:
# - I или IGNORECASE - регистр символов не учитывается:
p = re.compile(r'[а-яе]+$', re.I | re.U)
print('Найдено' if p.search('АБВГДЕЕ') else 'Нет')
p = re.compile(r'^[а-яе]+$', re.U)
print('Найдено' if p.search('АБВГДЕЕ') else 'Нет')
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#


# 132

